In [14]:
import pandas as pd
import numpy as np

In [15]:
# Imported the data in csv format 
data = {
    "Name": ["Amit", "Neha", "Ravi", "Pooja", None],
    "Age": [20, 21, np.nan, 22, 23],
    "Marks": [85, np.nan, 78, None, 90],
    "City": ["Delhi", "Mumbai", None, "Pune", "Bangalore"]
}
df = pd.DataFrame(data)

# Display the first few rows of the DataFrame
df.head()

# info about the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      float64
 2   Marks   3 non-null      float64
 3   City    4 non-null      object
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

# Finding Missing Data

In [ ]:
# To get missing values 
df.isnull() # This will return a DataFrame of the same shape with True for missing values and False for non-missing values
df.isna() # This is alies for isnull() and will return the same resul

    Name    Age  Marks   City
0  False  False  False  False
1  False  False   True  False
2  False   True  False   True
3  False  False   True  False
4   True  False  False  False

In [ ]:
df.notnull() # this is opposite of isnull()/isna()

    Name    Age  Marks   City
0   True   True   True   True
1   True   True  False   True
2   True  False   True  False
3   True   True  False   True
4  False   True   True   True

In [ ]:
# count missing values 

df.isnull().sum() # to count row or column wise give axis = 0,1

Name     1
Age      1
Marks    2
City     1
dtype: int64

In [26]:
# To check still is there any missing values
df.isnull().any()

Name     True
Age      True
Marks    True
City     True
dtype: bool

In [29]:
# percentage of missing data
(df.isnull().sum()/len(df))*100

Name     20.0
Age      20.0
Marks    40.0
City     20.0
dtype: float64

In [30]:
# Detecting missing data in a specific column
df["Age"].isnull()

0    False
1    False
2     True
3    False
4    False
Name: Age, dtype: bool

# Removing Missing data

In [5]:
# Remopving rows with missing values
df.dropna() # This will remove all rows that contain at least one missing value

   Name   Age  Marks   City
0  Amit  20.0   85.0  Delhi

In [ ]:
 # removing rows based on specific column
df.dropna(subset=['Age']) # This will remove rows where the 'Age' column has missing values

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0    NaN     Mumbai
3  Pooja  22.0    NaN       Pune
4   None  23.0   90.0  Bangalore

In [7]:
# Removing rows only if all values are missing
df.dropna(how='all') # This will remove rows where all values are missing

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0    NaN     Mumbai
2   Ravi   NaN   78.0       None
3  Pooja  22.0    NaN       Pune
4   None  23.0   90.0  Bangalore

In [8]:
# Removing rows if any value is missing 
df.dropna(how='any') # This will remove rows where any value is missing

   Name   Age  Marks   City
0  Amit  20.0   85.0  Delhi

In [9]:
# Removing columns with missing values
df.dropna(axis=1) # This will remove all columns that contain at least one missing value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [10]:
# Removing columns with missing values based on threshold
df.dropna(thresh=4, axis=1) # This will keep columns that have at least 4 non-missing values

    Name   Age       City
0   Amit  20.0      Delhi
1   Neha  21.0     Mumbai
2   Ravi   NaN       None
3  Pooja  22.0       Pune
4   None  23.0  Bangalore

In [11]:
# Removing missing data based on percentage of missing values
threshold = len(df) * 0.5 # Set threshold to 50% of the total number of rows
df.dropna(thresh=threshold, axis=1) # This will keep columns that have at least 50% non-missing values

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0    NaN     Mumbai
2   Ravi   NaN   78.0       None
3  Pooja  22.0    NaN       Pune
4   None  23.0   90.0  Bangalore

In [ ]:
# Removing data based on time series index
# Assuming 'Date' is a datetime index and we want to remove rows with missing values in the last 7 days
df.dropna(subset=['Date'], last='7D') # This will remove rows with missing values in the 'Date' column for the last 7 days

In [13]:
# Removing missing data after filtering
# For example, if we want to remove rows with missing values in the 'Marks' column after filtering for students older than 21
filtered_df = df[df['Age'] > 21] # Filter for students older than 21
filtered_df.dropna(subset=['Marks']) # This will remove rows with missing values in the 'Marks' column from the filtered DataFrame

   Name   Age  Marks       City
4  None  23.0   90.0  Bangalore

# Filling Missing Values

In [ ]:
# fillna()
df.fillna(0) # it fills zero or every anything else you give in the null places

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0    1.0     Mumbai
2   Ravi   1.0   78.0          1
3  Pooja  22.0    1.0       Pune
4      1  23.0   90.0  Bangalore

In [34]:
# Fill With mean
df["Marks"].fillna(df["Marks"].mean())

0    85.000000
1    84.333333
2    78.000000
3    84.333333
4    90.000000
Name: Marks, dtype: float64

In [35]:
# Fil with median 
df["Marks"].fillna(df["Marks"].median())

0    85.0
1    85.0
2    78.0
3    85.0
4    90.0
Name: Marks, dtype: float64

In [36]:
# Fill with mode
df["Marks"].fillna(df["Marks"].mode())

0    85.0
1    85.0
2    78.0
3     NaN
4    90.0
Name: Marks, dtype: float64

In [ ]:
# Forward fill
df.fillna(method="ffill")

C:\Users\SANJAY LADE\AppData\Local\Temp\ipykernel_14740\3823434521.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0   85.0     Mumbai
2   Ravi  21.0   78.0     Mumbai
3  Pooja  22.0   78.0       Pune
4  Pooja  23.0   90.0  Bangalore

In [38]:
# Backword fill
df.fillna(method="bfill")

C:\Users\SANJAY LADE\AppData\Local\Temp\ipykernel_14740\2625185423.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0   78.0     Mumbai
2   Ravi  22.0   78.0       Pune
3  Pooja  22.0   90.0       Pune
4   None  23.0   90.0  Bangalore

In [39]:
# Column wise diff strategies
df.fillna({
    "Age" : df["Age"].mean(),
    "Marks" : df["Marks"].median(),
    "Name" : "Unknown"
})

      Name   Age  Marks       City
0     Amit  20.0   85.0      Delhi
1     Neha  21.0   85.0     Mumbai
2     Ravi  21.5   78.0       None
3    Pooja  22.0   85.0       Pune
4  Unknown  23.0   90.0  Bangalore